tutorials/freelyPropagatingFlame/CH3OH/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.193335943;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 0.193335943;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.677597807;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
