tutorials/freelyPropagatingFlame/CH3OH/constant/conductivityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "The fits were computed between the temperatures of 300K and 3000K";
    location    "constant";
    object      conductivityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CH4
{
    b0              2.90447;
    b1              -5.429;
    b2              1.09851;
    b3              -0.0593947;
    chiSquare       0.00157025;
}

CH2O
{
    b0              -4.79399;
    b1              -2.9464;
    b2              0.816208;
    b3              -0.0493648;
    chiSquare       0.00266431;
}

CH3O
{
    b0              -18.7604;
    b1              3.00159;
    b2              -0.0149279;
    b3              -0.0106963;
    chiSquare       0.00138224;
}

H
{
    b0              -12.7137;
    b1              3.80144;
    b2              -0.419196;
    b3              0.0185681;
    chiSquare       7.41697e-06;
}

O2
{
    b0              -13.1697;
    b1              2.7796;
    b2              -0.256396;
    b3              0.010893;
    chiSquare       0.000389899;
}

H2
{
    b0              -1.5189;
    b1              -0.795903;
    b2              0.162718;
    b3              -0.00481969;
    chiSquare       0.000697033;
}

O
{
    b0              -10.0714;
    b1              2.03997;
    b2              -0.190602;
    b3              0.00867999;
    chiSquare       1.29698e-05;
}

OH
{
    b0              1.68167;
    b1              -2.83042;
    b2              0.474847;
    b3              -0.0205092;
    chiSquare       0.000621163;
}

H2O
{
    b0              6.34226;
    b1              -6.37523;
    b2              1.15051;
    b3              -0.0582322;
    chiSquare       2.0641e-05;
}

HO2
{
    b0              -12.3912;
    b1              2.23623;
    b2              -0.148908;
    b3              0.00514401;
    chiSquare       0.000163957;
}

H2O2
{
    b0              -10.608;
    b1              1.31028;
    b2              0.019403;
    b3              -0.00440726;
    chiSquare       5.1073e-05;
}

C
{
    b0              -9.54435;
    b1              1.74341;
    b2              -0.150507;
    b3              0.00687515;
    chiSquare       1.06881e-05;
}

CH
{
    b0              8.10809;
    b1              -5.73484;
    b2              0.91063;
    b3              -0.0416645;
    chiSquare       0.000841182;
}

CH2
{
    b0              0.896398;
    b1              -3.52558;
    b2              0.686612;
    b3              -0.03505;
    chiSquare       0.000281974;
}

CH2S
{
    b0              7.21589;
    b1              -6.42289;
    b2              1.12091;
    b3              -0.0564142;
    chiSquare       0.000182485;
}

CH3
{
    b0              2.36129;
    b1              -4.59439;
    b2              0.901371;
    b3              -0.0474522;
    chiSquare       0.000106394;
}

CO
{
    b0              -0.0907978;
    b1              -2.95359;
    b2              0.572591;
    b3              -0.0288972;
    chiSquare       0.000134308;
}

CO2
{
    b0              -22.462;
    b1              5.70454;
    b2              -0.543566;
    b3              0.0191783;
    chiSquare       6.72238e-05;
}

HCO
{
    b0              -4.43508;
    b1              -2.55003;
    b2              0.68168;
    b3              -0.0401313;
    chiSquare       0.0015656;
}

CH2OH
{
    b0              -12.1609;
    b1              0.825564;
    b2              0.21617;
    b3              -0.0185578;
    chiSquare       0.000239607;
}

CH3OH
{
    b0              -11.8815;
    b1              -0.0586616;
    b2              0.436798;
    b3              -0.0325009;
    chiSquare       0.002051;
}

C2H
{
    b0              0.993791;
    b1              -3.96808;
    b2              0.787089;
    b3              -0.0415123;
    chiSquare       0.00071744;
}

C2H2
{
    b0              -19.6477;
    b1              4.74717;
    b2              -0.429066;
    b3              0.0151841;
    chiSquare       0.0004041;
}

C2H3
{
    b0              -20.0319;
    b1              4.29749;
    b2              -0.282474;
    b3              0.00491233;
    chiSquare       0.000139935;
}

C2H4
{
    b0              -25.0809;
    b1              5.92203;
    b2              -0.442321;
    b3              0.00976096;
    chiSquare       0.000555589;
}

C2H5
{
    b0              -19.6041;
    b1              3.66336;
    b2              -0.133485;
    b3              -0.00428669;
    chiSquare       0.000497803;
}

C2H6
{
    b0              -21.5087;
    b1              4.28793;
    b2              -0.193807;
    b3              -0.00253457;
    chiSquare       0.000689511;
}

HCCO
{
    b0              -17.5694;
    b1              4.42808;
    b2              -0.401709;
    b3              0.0141296;
    chiSquare       3.77001e-05;
}

CH2CO
{
    b0              -19.7485;
    b1              3.93623;
    b2              -0.217112;
    b3              0.00131902;
    chiSquare       0.000135437;
}

HCCOH
{
    b0              -17.3275;
    b1              3.1761;
    b2              -0.14224;
    b3              -0.000817843;
    chiSquare       4.31909e-05;
}

N
{
    b0              -9.6212;
    b1              1.74341;
    b2              -0.150507;
    b3              0.00687515;
    chiSquare       1.06881e-05;
}

NH
{
    b0              -0.582131;
    b1              -1.86871;
    b2              0.350777;
    b3              -0.015161;
    chiSquare       0.000256472;
}

NH2
{
    b0              7.60703;
    b1              -5.8116;
    b2              0.97116;
    b3              -0.0463577;
    chiSquare       6.46265e-05;
}

NH3
{
    b0              0.812017;
    b1              -4.57256;
    b2              0.976315;
    b3              -0.0535293;
    chiSquare       0.000232132;
}

NNH
{
    b0              -3.77732;
    b1              -1.6823;
    b2              0.441429;
    b3              -0.0244979;
    chiSquare       0.00020744;
}

NO
{
    b0              -2.05845;
    b1              -2.07615;
    b2              0.44563;
    b3              -0.0228909;
    chiSquare       0.000164959;
}

NO2
{
    b0              -24.318;
    b1              6.79666;
    b2              -0.730829;
    b3              0.0293883;
    chiSquare       0.000661687;
}

N2O
{
    b0              -22.5271;
    b1              5.84292;
    b2              -0.578738;
    b3              0.0215141;
    chiSquare       5.50695e-05;
}

HNO
{
    b0              4.13073;
    b1              -5.1021;
    b2              0.919293;
    b3              -0.0458155;
    chiSquare       7.87202e-05;
}

CN
{
    b0              -10.8041;
    b1              2.088;
    b2              -0.215831;
    b3              0.0119541;
    chiSquare       0.00044512;
}

HCN
{
    b0              -9.9802;
    b1              -0.0694107;
    b2              0.314516;
    b3              -0.0219435;
    chiSquare       6.61737e-05;
}

H2CN
{
    b0              -12.5964;
    b1              0.597266;
    b2              0.287288;
    b3              -0.0233859;
    chiSquare       0.0017047;
}

HCNN
{
    b0              -18.782;
    b1              4.92435;
    b2              -0.466848;
    b3              0.0168945;
    chiSquare       1.04345e-05;
}

HCNO
{
    b0              -22.7605;
    b1              5.81656;
    b2              -0.54473;
    b3              0.0186263;
    chiSquare       0.000105087;
}

HOCN
{
    b0              -14.2305;
    b1              2.2259;
    b2              -0.0478879;
    b3              -0.00414352;
    chiSquare       0.000177787;
}

HNCO
{
    b0              -17.0762;
    b1              3.3788;
    b2              -0.201384;
    b3              0.00267505;
    chiSquare       0.000413874;
}

NCO
{
    b0              -22.0974;
    b1              5.68168;
    b2              -0.553331;
    b3              0.0200113;
    chiSquare       0.000139769;
}

N2
{
    b0              0.813228;
    b1              -3.26465;
    b2              0.607423;
    b3              -0.0301123;
    chiSquare       0.000130622;
}

AR
{
    b0              -15.0233;
    b1              3.61729;
    b2              -0.396227;
    b3              0.0176144;
    chiSquare       8.22539e-06;
}

C3H7
{
    b0              -30.232;
    b1              8.15922;
    b2              -0.772358;
    b3              0.0258625;
    chiSquare       0.000203907;
}

C3H8
{
    b0              -30.2075;
    b1              8.0111;
    b2              -0.731057;
    b3              0.0231446;
    chiSquare       0.000311946;
}

CH2CHO
{
    b0              -17.15;
    b1              2.63902;
    b2              -0.0067375;
    b3              -0.00946848;
    chiSquare       0.000688044;
}

CH3CHO
{
    b0              -20.3587;
    b1              3.70372;
    b2              -0.114348;
    b3              -0.00608262;
    chiSquare       0.00107336;
}


// ************************************************************************* //
