tutorials/freelyPropagatingFlame/CH3OH/constant/polyMesh/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0     0     	0)
    (0.02  0     	0)
    (0.02  0.002   	0)
    (0     0.002   	0)
    (0     0     	0.002)
    (0.02  0     	0.002)
    (0.02  0.002  	0.002)
    (0     0.002   	0.002)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)     (1000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }

    top
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (7 6 2 3)
	    (1 0 4 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
