tutorials/freelyPropagatingFlame/CH3OH/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel 		mixtureAverage;

mixtureAverageProperties
 {}

CHEMKINFile 			"$FOAM_CASE/chemkin/grimech30.dat";
CHEMKINThermoFile 		"$FOAM_CASE/chemkin/thermo30.dat";
CHEMKINTransportFile 	"$FOAM_CASE/chemkin/transport.dat";

// ************************************************************************* //
