tutorials/freelyPropagatingFlame/CH3OH/constant/viscosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "The fits were computed between the temperatures of 300K and 3000K";
    location    "constant";
    object      viscosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

CH4
{
    a0              -22.6673;
    a1              3.72518;
    a2              -0.40972;
    a3              0.0181762;
    chiSquare       7.74146e-06;
}

CH2O
{
    a0              -22.0316;
    a1              2.66124;
    a2              -0.162644;
    a3              0.00306491;
    chiSquare       0.000229166;
}

CH3O
{
    a0              -25.1063;
    a1              4.10701;
    a2              -0.380622;
    a3              0.0137143;
    chiSquare       9.25733e-05;
}

H
{
    a0              -23.0532;
    a1              3.80144;
    a2              -0.419196;
    a3              0.0185681;
    chiSquare       7.41697e-06;
}

O2
{
    a0              -19.9317;
    a1              2.887;
    a2              -0.302815;
    a3              0.013633;
    chiSquare       1.22419e-05;
}

H2
{
    a0              -15.6873;
    a1              0.806101;
    a2              -0.0220201;
    a3              0.00101598;
    chiSquare       3.64656e-07;
}

O
{
    a0              -17.6463;
    a1              2.03997;
    a2              -0.190602;
    a3              0.00867999;
    chiSquare       1.29698e-05;
}

OH
{
    a0              -17.6158;
    a1              2.03997;
    a2              -0.190602;
    a3              0.00867999;
    chiSquare       1.29698e-05;
}

H2O
{
    a0              -18.2379;
    a1              1.10218;
    a2              0.0662684;
    a3              -0.00789672;
    chiSquare       0.000354302;
}

HO2
{
    a0              -19.9162;
    a1              2.887;
    a2              -0.302815;
    a3              0.013633;
    chiSquare       1.22419e-05;
}

H2O2
{
    a0              -19.9012;
    a1              2.887;
    a2              -0.302815;
    a3              0.013633;
    chiSquare       1.22419e-05;
}

C
{
    a0              -17.406;
    a1              1.74341;
    a2              -0.150507;
    a3              0.00687515;
    chiSquare       1.06881e-05;
}

CH
{
    a0              -17.7494;
    a1              2.03997;
    a2              -0.190602;
    a3              0.00867999;
    chiSquare       1.29698e-05;
}

CH2
{
    a0              -22.9139;
    a1              3.78052;
    a2              -0.416602;
    a3              0.0184611;
    chiSquare       7.50492e-06;
}

CH2S
{
    a0              -22.9139;
    a1              3.78052;
    a2              -0.416602;
    a3              0.0184611;
    chiSquare       7.50492e-06;
}

CH3
{
    a0              -22.8792;
    a1              3.78052;
    a2              -0.416602;
    a3              0.0184611;
    chiSquare       7.50492e-06;
}

CO
{
    a0              -19.4111;
    a1              2.6191;
    a2              -0.267745;
    a3              0.0121031;
    chiSquare       1.34169e-05;
}

CO2
{
    a0              -25.8427;
    a1              4.94023;
    a2              -0.54451;
    a3              0.0230501;
    chiSquare       1.31099e-06;
}

HCO
{
    a0              -22.0486;
    a1              2.66124;
    a2              -0.162644;
    a3              0.00306491;
    chiSquare       0.000229166;
}

CH2OH
{
    a0              -25.1063;
    a1              4.10701;
    a2              -0.380622;
    a3              0.0137143;
    chiSquare       9.25733e-05;
}

CH3OH
{
    a0              -22.7289;
    a1              2.99103;
    a2              -0.211605;
    a3              0.00543054;
    chiSquare       0.00019727;
}

C2H
{
    a0              -25.4472;
    a1              4.6939;
    a2              -0.521855;
    a3              0.0224539;
    chiSquare       2.14839e-06;
}

C2H2
{
    a0              -25.4274;
    a1              4.6939;
    a2              -0.521855;
    a3              0.0224539;
    chiSquare       2.14839e-06;
}

C2H3
{
    a0              -25.4084;
    a1              4.6939;
    a2              -0.521855;
    a3              0.0224539;
    chiSquare       2.14839e-06;
}

C2H4
{
    a0              -26.8113;
    a1              5.09722;
    a2              -0.554894;
    a3              0.0230956;
    chiSquare       1.32745e-06;
}

C2H5
{
    a0              -26.4904;
    a1              4.98728;
    a2              -0.548403;
    a3              0.0231286;
    chiSquare       1.22647e-06;
}

C2H6
{
    a0              -26.4733;
    a1              4.98728;
    a2              -0.548403;
    a3              0.0231286;
    chiSquare       1.22647e-06;
}

HCCO
{
    a0              -21.8755;
    a1              3.90289;
    a2              -0.431713;
    a3              0.0190818;
    chiSquare       6.99556e-06;
}

CH2CO
{
    a0              -24.5282;
    a1              3.82377;
    a2              -0.336948;
    a3              0.0115473;
    chiSquare       0.000118563;
}

HCCOH
{
    a0              -24.5282;
    a1              3.82377;
    a2              -0.336948;
    a3              0.0115473;
    chiSquare       0.000118563;
}

N
{
    a0              -17.3292;
    a1              1.74341;
    a2              -0.150507;
    a3              0.00687515;
    chiSquare       1.06881e-05;
}

NH
{
    a0              -17.604;
    a1              2.03997;
    a2              -0.190602;
    a3              0.00867999;
    chiSquare       1.29698e-05;
}

NH2
{
    a0              -17.5715;
    a1              2.03997;
    a2              -0.190602;
    a3              0.00867999;
    chiSquare       1.29698e-05;
}

NH3
{
    a0              -22.6461;
    a1              3.007;
    a2              -0.213984;
    a3              0.00554573;
    chiSquare       0.000195721;
}

NNH
{
    a0              -17.2472;
    a1              1.74341;
    a2              -0.150507;
    a3              0.00687515;
    chiSquare       1.06881e-05;
}

NO
{
    a0              -19.3167;
    a1              2.60205;
    a2              -0.265498;
    a3              0.0120045;
    chiSquare       1.34702e-05;
}

NO2
{
    a0              -24.5674;
    a1              4.6142;
    a2              -0.513836;
    a3              0.0222041;
    chiSquare       2.67386e-06;
}

N2O
{
    a0              -25.6171;
    a1              4.86708;
    a2              -0.53811;
    a3              0.0228998;
    chiSquare       1.4697e-06;
}

HNO
{
    a0              -20.623;
    a1              3.137;
    a2              -0.335163;
    a3              0.0150279;
    chiSquare       1.08198e-05;
}

CN
{
    a0              -17.6464;
    a1              1.86839;
    a2              -0.167446;
    a3              0.00763943;
    chiSquare       1.18129e-05;
}

HCN
{
    a0              -18.8579;
    a1              1.17421;
    a2              0.0557787;
    a3              -0.00739785;
    chiSquare       0.000349971;
}

H2CN
{
    a0              -18.8396;
    a1              1.17421;
    a2              0.0557787;
    a3              -0.00739785;
    chiSquare       0.000349971;
}

HCNN
{
    a0              -21.8755;
    a1              3.90289;
    a2              -0.431713;
    a3              0.0190818;
    chiSquare       6.99556e-06;
}

HCNO
{
    a0              -25.6284;
    a1              4.86708;
    a2              -0.53811;
    a3              0.0228998;
    chiSquare       1.4697e-06;
}

HOCN
{
    a0              -25.6284;
    a1              4.86708;
    a2              -0.53811;
    a3              0.0228998;
    chiSquare       1.4697e-06;
}

HNCO
{
    a0              -25.6284;
    a1              4.86708;
    a2              -0.53811;
    a3              0.0228998;
    chiSquare       1.4697e-06;
}

NCO
{
    a0              -25.6403;
    a1              4.86708;
    a2              -0.53811;
    a3              0.0228998;
    chiSquare       1.4697e-06;
}

N2
{
    a0              -19.3511;
    a1              2.60205;
    a2              -0.265498;
    a3              0.0120045;
    chiSquare       1.34702e-05;
}

AR
{
    a0              -21.6832;
    a1              3.61729;
    a2              -0.396227;
    a3              0.0176144;
    chiSquare       8.22539e-06;
}

C3H7
{
    a0              -26.8524;
    a1              5.05522;
    a2              -0.553319;
    a3              0.0231835;
    chiSquare       1.16764e-06;
}

C3H8
{
    a0              -26.8409;
    a1              5.05522;
    a2              -0.553319;
    a3              0.0231835;
    chiSquare       1.16764e-06;
}

CH2CHO
{
    a0              -24.5164;
    a1              3.82377;
    a2              -0.336948;
    a3              0.0115473;
    chiSquare       0.000118563;
}

CH3CHO
{
    a0              -24.5048;
    a1              3.82377;
    a2              -0.336948;
    a3              0.0115473;
    chiSquare       0.000118563;
}


// ************************************************************************* //
